LinkedOut SRC/app/controllers/microposts_controller.rb

INSERT INTO "microposts" ("content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["content", "dsada"], ["created_at", "2014-09-14 16:10:57.091127"], ["updated_at", "2014-09-14 16:10:57.091127"], ["user_id", 1]]
---
  def create
  	@micropost = current_user.microposts.build(micropost_params)
    if @micropost.save