LinkedOut SRC/app/controllers/sessions_controller.rb

UPDATE "users" SET "remember_token" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["remember_token", "3fd8033cab531122b556a2ab005a3d349ee5d325"], ["updated_at", "2014-09-14 01:09:43.843559"]]
---
  def destroy
    current_user.update_attribute(:remember_token, User.hash(User.new_remember_token))