LinkedOut SRC/app/controllers/static_pages_controller.rb

  def home
    @micropost = current_user.microposts.build if signed_in?
    @application = Application.find(2)
---
SELECT  "applications".* FROM "applications"  WHERE "applications"."id" = ? LIMIT 1  [["id", 1]]