LinkedOut SRC/app/controllers/users_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "microposts".* FROM "microposts"  WHERE "microposts"."user_id" = ?  ORDER BY created_at DESC LIMIT 30 OFFSET 0  [["user_id", 1]]
SELECT COUNT(*) FROM "microposts"  WHERE "microposts"."user_id" = ?  [["user_id", 1]]
---
  def show
  	@user = User.find(params[:id])
  	@microposts = @user.microposts.paginate(page: params[:page])

INSERT INTO "users" ("created_at", "email", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-09-13 03:04:22.327046"], ["email", "dsadas"], ["name", "das"], ["updated_at", "2014-09-13 03:04:22.327046"]]
---
  def create
    @user = User.new(user_params)    # Strong paramter
    if @user.save

SELECT "users".* FROM "users"
---
  def index
    @users = User.paginate(page: params[:page], per_page: 3)

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 19]]
UPDATE "users" SET "address" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = 19  [["address", "10301 Mcqueen Dr."], ["password_digest", "$2a$10$zKsuFZu2Zip1cNTIErpjFucjA.e65vaUzT2uSagqQFkHVPszRw2DK"], ["updated_at", "2014-11-27 20:39:32.321765"]]
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)