LinkedOut SRC/app/views/shared/_user_info.html.erb

SELECT COUNT(*) FROM "microposts"  WHERE "microposts"."user_id" = ?  [["user_id", 1]]
---
  Hi, <%= current_user.name %>, your company have<span color="red">
  	<%= pluralize(current_user.microposts.count, "opening positions") %>